#### BorderTile Enumeration

---

|  |
| --- |
| See Also |

Options for controlling tiles that overlap the face boundary. See  DividedSurface  .

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public enum BorderTile ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration BorderTile ``` |

| Visual C++ |
| --- |
| ``` public enum class BorderTile ``` |

# Members

| Member name | Description |
| --- | --- |
| Empty |  |
| Partial |  |
| Overhanging |  |

# See Also

Autodesk.Revit.DB Namespace